app/controllers/actors_controller.rb

	def index
		@actors = Actor.all
---
SELECT "actors".* FROM "actors"

	def show
		@actor = Actor.find(params[:id])
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]